In [1]:
import numpy as np
import pandas as pd

In [2]:
ser = pd.Series(list("claruswas"))  # Seriler tek boyutlu axis labelı olan ndarray lerdir.
ser

0    c
1    l
2    a
3    r
4    u
5    s
6    w
7    a
8    s
dtype: object

In [3]:
ser.sort_index(ascending=False)  # artan/azalan yönde sıralamak için. default ascending değeri True. True olunca artan yönde, False olunca azalan yönde sıralama yapar.

8    s
7    a
6    w
5    s
4    u
3    r
2    a
1    l
0    c
dtype: object

In [ ]:
ser.sort_values()  # serinin değerlerini artan/azalan yönde sıralamak için kullanılır. Azalan yönde sıralamak için ascending=False kullanılmalıdır

In [5]:
ser.isin(["w"])  # parantez içine yazılan değerin seride olup olmadığını element bazında kontrol ederek boolean bir seri döndürür.

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
dtype: bool

In [6]:
ser[ser.isin(["w"])]  # serinin sadece "w" içeren elemanına ulaştık

6    w
dtype: object

In [7]:
ser.keys()  # serinin index labellarını döndürür

RangeIndex(start=0, stop=9, step=1)

In [8]:
ser.values  # verinin türüne göre ndarray veya ndarray-benzeri bir seri döndürür

array(['c', 'l', 'a', 'r', 'u', 's', 'w', 'a', 's'], dtype=object)

In [ ]:
ser.items()  # index ve değer çiftlerini içeren tupllardan oluşan bir iterable object döndürür.

In [ ]:
# read_csv("my_file.csv")  # CSV dosyalarını okumak için

In [9]:
df = pd.DataFrame(np.arange(1, 24, 2).reshape(3,4), columns=["var1","var2","var3","var4"])
df

   var1  var2  var3  var4
0     1     3     5     7
1     9    11    13    15
2    17    19    21    23

In [ ]:
df.head()  # veri setinin ilk n satırını görmek için default n=5

In [10]:
df.head(2)  # 2 satırı görmek için

   var1  var2  var3  var4
0     1     3     5     7
1     9    11    13    15

In [11]:
df.tail(2)  # veri setinin son n satırını görmek için. default n =5

   var1  var2  var3  var4
1     9    11    13    15
2    17    19    21    23

In [ ]:
df.sample(n=2)  # veri setinden rastgele seçilen n satırı getirir. default n=1 dir.

In [13]:
df.shape  # veri setinin tuple şeklinde şeklini döndürür.

(3, 4)

In [16]:
np.random.seed(101)
df = pd.DataFrame(np.random.randint(9, size=(5,4)), index="A B C D E".split(), columns= "W X Y Z".split())

In [17]:
df

   W  X  Y  Z
A  1  6  7  8
B  4  8  5  0
C  5  8  1  3
D  8  3  3  2
E  8  3  7  0

In [18]:
df.index  # veri setinin index değerlerini içeren bir object döndürür

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [19]:
df.columns  # veri setinin column name lerini içeren bir object döndürür

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [20]:
df.shape  # veri setinin şeklini(satır sayısı, sütun sayısı) içeren bir tuple döndürür.

(5, 4)

In [21]:
df.size  # veri setinin kaç elemandan oluştuğunu (satır syısı x sütun sayısı) döndürür

20

In [22]:
df.ndim  # veri setinin boyut(axis sayısı) sayısını döndürür.

2

In [23]:
df.reset_index()  # veri setinin indexini reset ederek default olarak atanan değerleri index yapar.

# Eğer veri seti multiindexli ise bu yöndem bir veya daha fazla indexi siler.

  index  W  X  Y  Z
0     A  1  6  7  8
1     B  4  8  5  0
2     C  5  8  1  3
3     D  8  3  3  2
4     E  8  3  7  0

In [ ]:
# df.set_index()  # var olan bir kolonu index olarak değiştirir.

In [24]:
newindx = "CA NY WY OR CO".split()
newindx

['CA', 'NY', 'WY', 'OR', 'CO']

In [25]:
df["newidx"] = newindx
df

   W  X  Y  Z newidx
A  1  6  7  8     CA
B  4  8  5  0     NY
C  5  8  1  3     WY
D  8  3  3  2     OR
E  8  3  7  0     CO

In [26]:
df.set_index("newidx")  # newidx kolonunu index yaptık.

        W  X  Y  Z
newidx
CA      1  6  7  8
NY      4  8  5  0
WY      5  8  1  3
OR      8  3  3  2
CO      8  3  7  0

In [27]:
df

   W  X  Y  Z newidx
A  1  6  7  8     CA
B  4  8  5  0     NY
C  5  8  1  3     WY
D  8  3  3  2     OR
E  8  3  7  0     CO

In [ ]:
df["W"] # bir veya daha fazla kolonu seçebilmek için kullanılır. Birden fazla kolon seçiminde kolon isimleri liste şeklide verilmelidir.

In [28]:
df[["W", "Z"]]  # sadece W ve Z kolonlarını görmek için

   W  Z
A  1  8
B  4  0
C  5  3
D  8  2
E  8  0

In [29]:
df.W  # bu şekilde de istediğiniz bir colona ulaşabilirsiniz

A    1
B    4
C    5
D    8
E    8
Name: W, dtype: int32

In [30]:
df.iloc[1,0]  # noktasal olarak veri seçmek/indekslemek için sayısal index-temelli locasyon özelliği kullanılır.

# Ör: 1. satır, 0. sütundaki değeri getirir.

4

In [31]:
df.loc["B","W"]  # satır ve sütun label isimlerine göre verilere ulaşmak için

4

In [ ]:
# conditional indexing

In [32]:
df[df["Y"] < 6]  # Y sütununda değeri 6'dan küçük olanlar için bütün verileri seçerek getirir.

   W  X  Y  Z newidx
B  4  8  5  0     NY
C  5  8  1  3     WY
D  8  3  3  2     OR

In [33]:
import seaborn as sns

In [34]:
df = sns.load_dataset("iris")
df.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [36]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [37]:
df.shape

(150, 5)

In [38]:
len(df)

150

In [40]:
df.species.value_counts()  # kategorik veri içeren bir kolondaki kategorik verilerin sayısını verir.

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [41]:
df.mean()

C:\Users\user\AppData\Local\Temp/ipykernel_19980/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [42]:
df.sepal_length.sum()  # belirtilen kolondaki değerlerin toplamını verir.

876.5

In [43]:
df.species.unique()  # unique veriler görülme sırasına göre bir array object olarak döndürülür.

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [45]:
df.isnull().sum()  # her kolon için null verilerin sayısını verir.

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [46]:
df.drop("sepal_length", axis=1)  # satır veya sütunu belirtilen isimlere/etiketlere ve ilgili axis'e göre siler.

     sepal_width  petal_length  petal_width    species
0            3.5           1.4          0.2     setosa
1            3.0           1.4          0.2     setosa
2            3.2           1.3          0.2     setosa
3            3.1           1.5          0.2     setosa
4            3.6           1.4          0.2     setosa
..           ...           ...          ...        ...
145          3.0           5.2          2.3  virginica
146          2.5           5.0          1.9  virginica
147          3.0           5.2          2.0  virginica
148          3.4           5.4          2.3  virginica
149          3.0           5.1          1.8  virginica

[150 rows x 4 columns]

In [49]:
df = pd.DataFrame(np.arange(12).reshape(3,4), columns=["A","B","C","D"])
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [50]:
df.drop(["A","D"], axis=1)

   B   C
0  1   2
1  5   6
2  9  10